## 1. Primeiros passos (titanic)

Nesessário instalar bilbiotecas. Pode ser feito por aqui usando "!pip" ou usando terminal. Abaixo como instalar pandas.

In [49]:
# !pip install pandas

Uma vez instalada a biblioteca, é necessário importá-la para o ambiente de trabalho. O nome da biblioteca é "pandas" e a forma mais comum de a importar é usando o alias "pd". O alias é uma forma abreviada de se referir à biblioteca, facilitando a escrita do código.

In [50]:
import pandas as pd

## 2. Importando dados

Inicialmente, vamos importar um dataset conhecido, o "titanic". Este dataset contém informações sobre os passageiros do navio Titanic, incluindo se eles sobreviveram ou não, sua classe de cabine, idade, sexo, entre outros dados.

In [51]:
#dataset source
path = "../../00_Datasets/titanic.csv"

#read dataframe
ds = pd.read_csv(path)

#show first 10 rows
ds.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [52]:
#show last 10 rows
ds.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Descreva o que é cada linha e cada coluna. Faça um report sobre o seu entedimento.

Após analise do dataset acima quais incompatibilidades ou problemas de qualidade de dados voce identificou? Quais colunas tem valores faltantes? Quais colunas tem valores inconsistentes? Quais colunas tem valores duplicados? Quais colunas tem valores fora do intervalo esperado?

Uma maneira inteligente de fazer isso é talvez fazer uma coluna sumária que analise cada coluna e sua completude, consistência, duplicidade e validade. Portanto crie uma tabela sumária sobre com as colunas descritas abaixo:

In [1]:
#nome da coluna
#tipo de dados
#quantidade de valores únicos
#quantidade de valores faltantes
#quantidade de valores duplicados
#quantidade de dados inteiros
#quantidade de dados float
#quantidade de dados string
#quantidade de dados booleanos
#quantidade de dados nulos

Com base na analise da tabela acima quais questoes pode levantar sobre a integridade dos dados?

Com o seu conhecimento da historia do Titanic, quais hipoteses emergem a partir da sua exploracao dos dados? Quais perguntas voce gostaria de responder? Quais hipoteses voce gostaria de testar?

Se estiver sem ideias, tente responder as seguintes perguntas:
- Qual era a proporção de sobreviventes em relação ao total de passageiros?
- Qual era a proporção de sobreviventes por classe de cabine?
- Qual era a proporção de sobreviventes por sexo?
- Qual era a proporção de sobreviventes por faixa etária? `['0-12', '13-18', '19-35', '36-60', '60+']`
- Qual era a proporção de sobreviventes por número de irmãos/cônjuges a bordo?
- Qual era a proporção de sobreviventes por número de pais/filhos a bordo?